Models/HTR-10_long_coupled/OF/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     GeN-Foam;

startFrom       latestTime;

startTime       0;

stopAt          nextWrite;

deltaT          0.1;

writeControl    adjustableRunTime;

writeInterval   5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

solveFluidMechanics true;

solveEnergy     true;

solveNeutronics false;

solveThermalMechanics false;

liquidFuel      false;

adjustTimeStep  true;

maxDeltaT       1;

maxCo           10;


// ************************************************************************* //
