Models/HTR-10_long_coupled/OF/constant/neutroRegion/nuclearData
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      esfr_core__res;
}
fastNeutrons            true; // if true interpolates cross section with logarithmic temp for fuel (otherwise, square root)

adjustDiscFactors       false;

useGivenDiscFactors     false;

energyGroups 1 ;

precGroups 1 ; 

zones
 (

 );
