Models/HTR-10_long_coupled/OF/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
47277
(
-0.0298159
-0.0294868
-0.0291581
-0.137825
-0.136268
-0.134711
-0.222128
-0.219641
...
)
;

boundaryField
{
    Inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
842
(
-0.030867
-0.116395
-0.0609284
-0.200297
-0.14488
-0.282712
-0.227425
-0.363544
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
92
(
0.00660145
0.0298241
0.00661856
0.0372502
-0.0859704
0.0946331
-0.0549421
0.0356522
...
)
;
    }
    Wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
5528
(
-0.0298704
-0.138661
-0.223341
-0.184262
-0.308512
-0.267452
-0.391062
-0.35114
...
)
;
    }
}


// ************************************************************************* //
