Models/HTR-10_long_coupled/OF/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
47277
(
-3.48663
-3.48274
-3.47885
-3.49112
-3.48724
-3.48337
-3.48993
-3.48606
...
)
;

boundaryField
{
    Inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
842
(
-1.2
-1.2
-1.2
-1.2
-1.2
-1.2
-1.2
-1.2
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
92
(
-6.1
-6.1
-6.1
-6.1
-6.1
-6.1
-6.1
-6.1
...
)
;
    }
    Wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
5528
(
-3.48846
-3.49294
-3.49175
-3.46651
-3.49309
-3.46666
-3.49383
-3.46874
...
)
;
    }
}


// ************************************************************************* //
