Models/HTR-10_long_coupled/OF/0/fluidRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluidRegion";
    object      T;
}
dimensions [0 0 0 1 0 0 0];
internalField   nonuniform List<scalar>
32670
(
700
700
700
700
700
700
700
700
...
)
;
boundaryField
{
    Inlet
    {
        type            fixedValue;
        value uniform 523.15;
    }
    Outlet
    {
        type            zeroGradient;
    }
    Wall
    {
        type            zeroGradient;
    }
}
