Models/HTR-10_long_coupled/OF/0/fluidRegion/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluidRegion";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.13500000000000004;

boundaryField
{
    Inlet
    {
        type            inletOutlet;
        inletValue      uniform 0.13500000000000004; // *100, /100 do not change anything
        value           uniform 0.13500000000000004;
    }
    Outlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.13500000000000004;
        value           uniform 0.13500000000000004;
    }
    Wall
    {
        type            zeroGradient;
        value           $internalField;
    }
}


// ************************************************************************* //
