Models/HTR-10_long_coupled/OF/0/fluidRegion/powerDensityNeutronics
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "./ifc/fluidRegion";
    object      powerDensityNeutronics;
}

dimensions      [1 -1 -3 0 0 0 0];

internalField   nonuniform List<scalar>
32670
(
 1.78505E+06
 0.00000E+00
 2.27208E+06
 0.00000E+00
 0.00000E+00
 0.00000E+00
 0.00000E+00
 5.91281E+05
...
)
;

boundaryField
{
    Inlet
    {
        type            zeroGradient;
        value           uniform 0;
    }
    Outlet
    {
        type            zeroGradient;
        value           uniform 0;
    }
    Wall
    {
        type            zeroGradient;
        value           uniform 0;
    }
}

